app/Controllers/Admin.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard',
        ];

        $bidan = new BidanModel();
        $kader = new KaderModel();
        $agenda = new AgendaModel();
        $bumil = new BumilModel();
        $ortu = new OrtuModel();
        $anak = new AnakModel();
        $kesbumil = new KesbumilModel();
        $kb = new KbModel();
        $timbang = new PenimbanganModel();
        $imun = new ImunisasiModel();
        $data['jumlah_bidan'] = $bidan->countAll();
        $data['jumlah_kader'] = $kader->countAll();
        $data['jumlah_agenda'] = $agenda->countAll();
        $data['jumlah_bumil'] = $bumil->countAll();
        $data['jumlah_ortu'] = $ortu->countAll();
        $data['jumlah_anak'] = $anak->countAll();
        $data['jumlah_kesbumil'] = $kesbumil->countAll();
        $data['jumlah_kb'] = $kb->countAll();
        $data['jumlah_timbang'] = $timbang->countAll();
        $data['jumlah_imun'] = $imun->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `bidan`
SELECT COUNT(*) AS `numrows` FROM `kader`
SELECT COUNT(*) AS `numrows` FROM `agenda`
SELECT COUNT(*) AS `numrows` FROM `bumil`
SELECT COUNT(*) AS `numrows` FROM `ortu`
SELECT COUNT(*) AS `numrows` FROM `anak`
SELECT COUNT(*) AS `numrows` FROM `kesbumil`
SELECT COUNT(*) AS `numrows` FROM `penimbangan`
SELECT COUNT(*) AS `numrows` FROM `imunisasi`