app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `email` = 'kader1@gmail.com'
---
    public function store()
    {
        $session = session();
        $db      = \Config\Database::connect();
        $builder = $db->table('users');
        $query   = $builder->getWhere(['email' => $this->request->getPost('login')])->getRow();