app/Controllers/Notif.php

SELECT *
FROM `notif`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `notif`
---
    public function index()
    {
        $currentPage = $this->request->getVar('page_notif') ? $this->request->getVar('page_notif') : 1;

        $keyword = $this->request->getVar('keyword');
        if($keyword){
            $notif = $this->notifModel->search($keyword);
        }else{
            $notif = $this->notifModel;
        }

        $data  = [
            'notif' => $notif->paginate(5, 'notif'),
            'pager' => $this->notifModel->pager,
            'currentPage' => $currentPage,
            'notif' => $this->notifModel->getNotif()
        ];