app/Models/AllModel.php

    public function login($username, $password)
    {
        // Check if the username exists
        $user = $this->db->table('users')
            ->where('users.username', $username)
            ->join('anak', 'users.id = anak.iduser', 'left')
            ->get()
            ->getRowArray();
---
SELECT *
FROM `users`
LEFT JOIN `anak` ON `users`.`id` = `anak`.`iduser`
WHERE `users`.`username` = 'saniamalaika'

    public function get_agenda()
    {
        return $this->db->table('agenda')
            ->join('kader', 'agenda.idkader = kader.idkader', 'left')
            ->select('agenda.*, kader.idkader as idkader, kader.kadernama as kadernama')
            ->orderBy('agenda.idagenda', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `agenda`.*, `kader`.`idkader` as `idkader`, `kader`.`kadernama` as `kadernama`
FROM `agenda`
LEFT JOIN `kader` ON `agenda`.`idkader` = `kader`.`idkader`
ORDER BY `agenda`.`idagenda` DESC