app/Models/ImunisasiModel.php

    public function dataAllAnak()
    {
        $anakExisting = [];

        $imunisasi = $this->db->table('imunisasi')->get()->getResultObject();
        $penimbangan = $this->db->table('penimbangan')->get()->getResultObject();

        foreach ($imunisasi as $value) {
            array_push($anakExisting,$value->idanak);
        }
        foreach ($penimbangan as $value) {
            array_push($anakExisting,$value->idanak);
        }

        $dataAnak = $this->db->table('anak')->whereNotIn('idanak',$anakExisting)->get()->getResultObject();
---
SELECT *
FROM `imunisasi`
SELECT *
FROM `penimbangan`
SELECT *
FROM `anak`
WHERE `idanak` NOT IN ('11','11','11','11')