app/Models/KesbumilModel.php

SELECT *
FROM `kesbumil`
SELECT *
FROM `bumil`
WHERE `idbumil` NOT IN ('1','2','1','2','2','2','1','2')
---
    public function dataAll()
    {
        $bumilExisting = [];

        $kesbumil = $this->db->table('kesbumil')->get()->getResultObject();
        $kb = $this->db->table('kb')->get()->getResultObject();

        foreach ($kesbumil as $value) {
            array_push($bumilExisting,$value->idbumil);
        }
        foreach ($kb as $value) {
            array_push($bumilExisting,$value->idbumil);
        }

        $dataBumil = $this->db->table('bumil')->whereNotIn('idbumil',$bumilExisting)->get()->getResultObject();

SELECT `bumil`.`ibunama`, `kesbumil`.`umurkandungan`
FROM `kesbumil`
JOIN `bumil` ON `kesbumil`.`idbumil` = `bumil`.`idbumil`
WHERE `kesbumil`.`umurkandungan` >= 9
---
    public function getBumil9Bulan()
    {
        return $this->select('bumil.ibunama, kesbumil.umurkandungan')
            ->join('bumil', 'kesbumil.idbumil = bumil.idbumil')
            ->where('kesbumil.umurkandungan >=', 9)
            ->findAll();