app/Models/LaporankomdatModel.php

SELECT `laporan`.*
FROM `laporan`
ORDER BY `laporan`.`idlaporan` DESC
---
    public function getAllData()
    {
        return $this->db->table($this->table)
                ->select('laporan.*')
                ->orderBy('laporan.idlaporan','DESC')->get()->getResultObject();

SELECT *
FROM `laporan`
WHERE `idlaporan` = '3'
 LIMIT 1
---
    public function getLaporan($idlaporankomdat)
    {
       return $this->where(['idlaporan'=> $idlaporankomdat])->first();