app/Models/NotifModel.php

    public function getNotif()
    {
    return $this->db->table('notif')
        ->select('b.anaknama, c.namaImun, notif.idnotif')
        ->join('anak b', 'notif.idanak = b.idanak', 'left')
        ->join('jenisImun c', 'notif.idJenImun = c.idJenImun', 'left')
        ->get()
        ->getResultObject();
---
SELECT `b`.`anaknama`, `c`.`namaImun`, `notif`.`idnotif`
FROM `notif`
LEFT JOIN `anak` `b` ON `notif`.`idanak` = `b`.`idanak`
LEFT JOIN `jenisImun` `c` ON `notif`.`idJenImun` = `c`.`idJenImun`

    public function getNotifTop()
    {
        // Ambil tanggal awal dan akhir dari bulan ini
        $startDate = date('Y-m-01 00:00:00');
        $endDate = date('Y-m-t 23:59:59');

        return $this->db->table('notif')
            ->select('b.anaknama, c.namaImun, notif.idnotif')
            ->join('anak b', 'notif.idanak = b.idanak', 'left')
            ->join('jenisImun c', 'notif.idJenImun = c.idJenImun', 'left')
            ->where('notif.created_at >=', $startDate)
            ->where('notif.created_at <=', $endDate)
            ->limit(5)
            ->get()
            ->getResultObject();
---
SELECT `b`.`anaknama`, `c`.`namaImun`, `notif`.`idnotif`
FROM `notif`
LEFT JOIN `anak` `b` ON `notif`.`idanak` = `b`.`idanak`
LEFT JOIN `jenisImun` `c` ON `notif`.`idJenImun` = `c`.`idJenImun`
WHERE `notif`.`created_at` >= '2024-06-01 00:00:00'
AND `notif`.`created_at` <= '2024-06-30 23:59:59'
 LIMIT 5